---
kind: other
id: Methods.T:Autodesk.Revit.DB.ProjectLocationSet
source: html/1a12996b-6ce2-aacc-b338-88ef56a50858.htm
---
# ProjectLocationSet Methods

Removes every project location from the set, rendering it empty.